; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph3 - mode
	image2 - mode
	thermograph0 - mode
	image1 - mode
	Star6 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star1 - direction
	Star7 - direction
	Star3 - direction
	Star9 - direction
	GroundStation2 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image2)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star9)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star7)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star9)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
)
(:goal (and
	(pointing satellite1 Phenomenon10)
	(have_image Phenomenon10 thermograph0)
	(have_image Phenomenon11 spectrograph3)
	(have_image Phenomenon12 image1)
	(have_image Planet13 image1)
	(have_image Star14 spectrograph3)
))

)

; plan
1. (turn_to satellite0 groundstation4 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 0 of 6
5. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 1 of 6
6. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 1 of 6
7. (take_image satellite0 phenomenon11 instrument0 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 2 of 6
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 6
9. (take_image satellite0 phenomenon10 instrument0 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 6
10. (turn_to satellite0 planet13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet13)
   goals met: 3 of 6
11. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 4 of 6
12. (turn_to satellite0 star14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star14)
   goals met: 4 of 6
13. (take_image satellite0 star14 instrument0 spectrograph3)
   added: (have_image star14 spectrograph3)
   goals met: 5 of 6
14. (turn_to satellite1 phenomenon10 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon10)
   goals met: 6 of 6
